#include <stdio.h>

#ifndef ROW，COL
#define  ROW 3
#define  COL 4
#endif

int main()
{
	// !! 错误，不能够临时定义数组大小 !!
	/*int r = 3;
	int c = 4;
	int a[r][c] = {{1,2,3,4},{5,6,7,8},{9,10,11,12}};*/

	int a[3][4] = {{1,2,3,4},{5,6,7,8},{9,10,11,12}}; //花括号显式地指定每行元素
	int b[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12}; //根据维数（第二维）隐式地确定每行元素

	//可以使用宏定义指定数组维数，因为宏定义在预编译阶段就已处理，ROW，COL是确定的

	int c[ROW][COL] = {{1},{2,3},{4,5,6,7}}; //可以部分地指定每行元素值，未指定默认0
	//int c[ROW][COL] = {{1},{},{4,5,6,7}}; //每一行必须赋初值，否则出错

	int d[ROW][COL] = {0};//快速地将所有元素初始化为0
	
	//可以不指定二维数组的第一维大小，但必须指定第二维大小，编译器会据此自动确定第一维大小。
	int e[][COL]  = {{1},{2,3},{4,5,6}}; //通过花括号隐式地指定了第一维大小

	//通过第二维自动计算出第一维大小，元素数量必须为第二维的整倍数，否则出错
	int f[][COL]  = {1,2,3,4,5,6,7,8}; 
	
	//输出二维数组
	int i,j;
	for (i=0;i<ROW;i++)
	{ 
		for (j=0;j<COL;j++)
		{printf("%4d",c[i][j]);
		}
		printf("\n");
	}
	return 0;
}